{
  "backend/main.mo": "Motoko canister defining user profiles, jobs, applications, credit usage, and related maps plus authorization mixin and comparison helpers.",
  "feature_evidence.json": "Feature evidence report describing a fix for a ManualAuthProvider runtime error and listing impacted files and components.",
  "frontend-file-summaries.txt": "Text file summarizing multiple frontend components, pages, and utilities involved in routing, auth, jobs, and UI features.",
  "frontend/docs/missing-canister-functions.md": "Documentation listing required backend methods for diagnostics and instructions for detecting missing actor methods.",
  "frontend/index.css": "Root Tailwind CSS file defining global OKLCH theme variables, light/dark palettes, and base styles.",
  "frontend/index.html": "Basic HTML entrypoint loading the React app via main.tsx into the root div.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes and wrapping RouterProvider with ManualAuthProvider and ThemeProvider.",
  "frontend/src/auth/manualAuthTypes.ts": "Type definitions for manual auth including UserRole, session shape, and login credentials.",
  "frontend/src/components/admin/AdminCreditsSettings.tsx": "UI for viewing and updating the credit cost per candidate unlock using admin mutations.",
  "frontend/src/components/admin/AdminEmployersTable.tsx": "Displays all employers with credit balances and allows admins to add or deduct credits via dialog actions.",
  "frontend/src/components/admin/AdminJobseekersTable.tsx": "Lists all jobseekers with basic status information in a table.",
  "frontend/src/components/admin/AdminMetricsCards.tsx": "Shows dashboard metric cards for employers, jobseekers, and total credits used.",
  "frontend/src/components/admin/AdminUnlockLogs.tsx": "Displays flattened unlock activity logs including employer, candidate, credits used, and timestamp.",
  "frontend/src/components/AppFooter.tsx": "Footer component with branding, caffeine.ai link, and simple navigation links.",
  "frontend/src/components/AppHeader.tsx": "Header with logo, role‑based navigation, auth dropdown, and mobile sheet menu.",
  "frontend/src/components/AppLayout.tsx": "Page layout wrapping header and footer while applying role-based class and rendering children.",
  "frontend/src/components/applications/CandidateApplyForm.tsx": "Empty placeholder file for a candidate application form component.",
  "frontend/src/components/auth/InternetIdentityHelpDialog.tsx": "Empty placeholder file for an Internet Identity help dialog component.",
  "frontend/src/components/auth/LoginPage.tsx": "Login page handling manual auth for jobseekers, employers, and admins with role‑based navigation.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Route wrapper that restricts access based on authentication state and required user roles.",
  "frontend/src/components/auth/RoleSetupModal.tsx": "Empty placeholder file for a role setup modal component.",
  "frontend/src/components/employer/CandidateUnlockCard.tsx": "Employer card showing candidate details with locked/unlocked view and an unlock confirmation flow.",
  "frontend/src/components/employer/UnlockConfirmDialog.tsx": "Dialog component that displays credit cost, balance, and confirmation for unlocking a candidate profile.",
  "frontend/src/components/jobs/EmployerJobForm.tsx": "Empty file.",
  "frontend/src/components/jobs/JobCard.tsx": "Empty file.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing queries when identity changes.",
  "frontend/src/hooks/useAdminQueries.ts": "Provides admin-focused queries and mutations for employers, jobseekers, unlock logs, and credit management.",
  "frontend/src/hooks/useEmployerCredits.ts": "Hooks to fetch employer credit balance and credit cost per profile unlock.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useManualAuth.tsx": "Implements a simple manual auth system with localStorage-backed sessions and role handling.",
  "frontend/src/hooks/useQueries.ts": "Hooks for fetching and saving user profiles and retrieving the candidate directory.",
  "frontend/src/hooks/useUnlockCandidate.ts": "Mutation hook to unlock a candidate profile and refresh related data.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark themes and role-specific accent variables.",
  "frontend/src/main.tsx": "Application entry point initializing React, query client, and Internet Identity provider.",
  "frontend/src/pages/admin/AdminPanelPage.tsx": "Admin dashboard with metrics and tabbed views for employers, jobseekers, credits, and unlock logs.",
  "frontend/src/pages/CandidateDashboardPage.tsx": "Empty file.",
  "frontend/src/pages/EmployerCandidatesPage.tsx": "Loads and filters candidate directory for employers, supports searching, skill filtering, and unlocking profiles with credit checks.",
  "frontend/src/pages/EmployerDashboardPage.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/EmployerJobApplicationsPage.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/JobDetailPage.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/JobsBrowsePage.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero, features, and calls to action for jobseekers and employers.",
  "frontend/src/utils/actorDiagnostics.ts": "Provides utilities to check backend actor methods and log missing methods for debugging.",
  "frontend/src/utils/actorErrorMessages.ts": "Normalizes actor-related errors into user-friendly messages and detects missing method errors.",
  "frontend/src/utils/actorGuards.ts": "Defines guards to ensure actor methods exist and provides a safe wrapper for invoking them.",
  "frontend/src/utils/formatInr.ts": "Formats and parses INR currency values, including compact lakh formatting.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and persisting URL parameters across navigation, including hash routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended colors, radii, shadows, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes project state for a mobile-first job portal, including architecture decisions, known issues, and existing feature records with versioning."
}