{
  "backend/main.mo": "Primary canister logic defining user, job, application, credit, and unlocking types with initial state maps and authorization mixin.",
  "backend/migration.mo": "Migration module converting old user profile structures into the new expanded profile format during canister upgrades.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing frontend components, hooks, pages, and utilities.",
  "frontend/docs/missing-canister-functions.md": "Documentation explaining frontend diagnostics for detecting missing backend canister methods and how to reproduce issues.",
  "frontend/index.css": "Tailwind-based global stylesheet defining color variables, themes, and base styling for light and dark modes.",
  "frontend/index.html": "Root HTML entry point mounting the SPA and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Sets up the app’s router, protected routes, theme provider, and root layout using TanStack Router.",
  "frontend/src/auth/manualAuthTypes.ts": "Defines TypeScript types for user roles, auth session, and login credentials.",
  "frontend/src/components/admin/AdminCreditsSettings.tsx": "Admin UI for viewing and updating the credit cost per candidate unlock.",
  "frontend/src/components/admin/AdminEmployersTable.tsx": "Shows a table of employers and allows admins to add or deduct credits via dialogs.",
  "frontend/src/components/admin/AdminJobseekersTable.tsx": "Displays a list of all jobseekers with basic status info.",
  "frontend/src/components/admin/AdminMetricsCards.tsx": "Presents dashboard metrics for employers, jobseekers, and credits used.",
  "frontend/src/components/admin/AdminUnlockLogs.tsx": "Displays employer unlock activity logs with timestamps and credit usage.",
  "frontend/src/components/AppFooter.tsx": "Renders the site footer with branding, links, and styling.",
  "frontend/src/components/AppHeader.tsx": "Implements the site header with navigation, user menu, and role‑based links.",
  "frontend/src/components/AppLayout.tsx": "Wraps pages with header, footer, and role-based layout container.",
  "frontend/src/components/applications/CandidateApplyForm.tsx": "Empty placeholder component for candidate application form.",
  "frontend/src/components/auth/InternetIdentityHelpDialog.tsx": "Empty placeholder component for an Internet Identity help dialog.",
  "frontend/src/components/auth/LoginPage.tsx": "A login page component handling email/password auth for three user roles and redirecting after login.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Wraps pages with role-based access control, redirecting unauthorized users to the login page.",
  "frontend/src/components/auth/RoleSetupModal.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/employer/CandidateUnlockCard.tsx": "Displays candidate info with locked/unlocked states and triggers an unlock confirmation dialog.",
  "frontend/src/components/employer/UnlockConfirmDialog.tsx": "A dialog showing credit cost and balance before confirming profile unlock, with validation and loading states.",
  "frontend/src/components/jobs/EmployerJobForm.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/jobs/JobCard.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useAdminQueries.ts": "Provides admin-oriented queries and mutations for employers, jobseekers, unlock logs, and credit management.",
  "frontend/src/hooks/useEmployerCredits.ts": "Hooks to fetch employer credit balance and the credit cost per unlock.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for Internet Identity login, managing identity state, statuses, and AuthClient handling.",
  "frontend/src/hooks/useManualAuth.tsx": "Provides a context-based manual auth system with session storage, login/logout, and role handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and saving user profiles and retrieving the candidate directory via actor methods.",
  "frontend/src/hooks/useUnlockCandidate.ts": "Mutation hook to unlock a candidate profile and refresh related queries.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables, dark mode, and role-based theme accents.",
  "frontend/src/main.tsx": "App entry point initializing React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/admin/AdminPanelPage.tsx": "Admin dashboard with tabs for employers, jobseekers, credits, and unlock logs.",
  "frontend/src/pages/CandidateDashboardPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/EmployerCandidatesPage.tsx": "Employer UI for browsing, filtering, and unlocking candidate profiles with credit checks.",
  "frontend/src/pages/EmployerDashboardPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/EmployerJobApplicationsPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/JobDetailPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/JobsBrowsePage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page with hero section, feature cards, and navigation buttons.",
  "frontend/src/utils/actorDiagnostics.ts": "Utilities to check actor objects for required backend methods and log diagnostics.",
  "frontend/src/utils/actorErrorMessages.ts": "Normalizes backend actor errors into user-friendly messages and detects missing method errors.",
  "frontend/src/utils/actorGuards.ts": "Provides guard utilities to verify actor methods exist and safely invoke them, throwing custom errors when missing.",
  "frontend/src/utils/formatInr.ts": "Formats numbers as Indian Rupees with optional compact lakh format and parses INR strings back to numbers.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based parameter cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, shadows, and radius with plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file describing scope, architecture notes, issues, and existing feature definitions for the Instant Jobs platform."
}