{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Manual credential auth + role gating, employer credits unlock UI, admin panel, and refreshed Instant Jobs theme",
  "requirements": [
    {
      "id": "REQ-17",
      "summary": "Replace Internet Identity UI/auth usage with in-app manual credentials auth (Jobseeker/Employer/Admin), enforce role-gated navigation, and ensure logout clears session + cached data.",
      "acceptanceCriteria": [
        "App no longer shows any Internet Identity sign-in copy or Internet Identity help content anywhere in the UI.",
        "Jobseeker can log in/out using manual credentials and can access only jobseeker pages (e.g., apply flow, applied jobs dashboard).",
        "Employer can log in/out using manual credentials and can access only employer pages (e.g., employer dashboard, candidate directory).",
        "Admin can log in/out using manual credentials and can access only admin pages (admin panel).",
        "Attempting to visit role-protected routes while logged out redirects to a login screen (or shows a clear access denied + login CTA).",
        "Role switching requires logout, and session state is cleared on logout (including React Query caches where applicable)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Remove the InternetIdentityProvider wrapper and wire in a new ManualAuthProvider at the app root so the UI no longer depends on Internet Identity for authentication state."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Extend the typed backend interface to include manual-auth capabilities used by the frontend (e.g., login/logout/session introspection and role). This ensures TypeScript-safe calls for the new manual-credentials flow."
        },
        {
          "path": "frontend/src/auth/manualAuthTypes.ts",
          "operation": "create",
          "description": "Add shared frontend types for manual-auth state (session token, role mapping for Jobseeker/Employer/Admin, and basic session metadata) to keep role gating consistent across UI."
        },
        {
          "path": "frontend/src/hooks/useManualAuth.tsx",
          "operation": "create",
          "description": "Create a ManualAuthProvider + hooks to manage in-app credential login/logout, persist the session token securely in browser storage, expose current role, and clear React Query caches on logout. Use the selected \"authorization\" component’s frontend guidance for role-based access patterns and cache clearing. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/LoginPage.tsx",
          "operation": "create",
          "description": "Implement a mobile-first login screen for manual credentials with explicit role intent (Jobseeker / Employer / Admin), clear validation/error states, and no Internet Identity references."
        },
        {
          "path": "frontend/src/components/auth/ProtectedRoute.tsx",
          "operation": "create",
          "description": "Add a reusable route guard component that blocks rendering unless the required role is present; when blocked, redirect to /login (or render a clear access denied + login CTA). Use the selected \"authorization\" component’s frontend guidance for access denied UX. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire /login and /admin routes, and enforce role protection by wrapping role-gated pages (candidate dashboard, employer dashboard/candidates, admin panel) using ProtectedRoute so they are inaccessible until the correct role is logged in."
        },
        {
          "path": "frontend/src/components/AppHeader.tsx",
          "operation": "modify",
          "description": "Replace Internet Identity controls with manual login/logout UI (show current role + logout). Remove Internet Identity help trigger and copy, and ensure logout triggers ManualAuth logout and clears React Query caches."
        },
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Remove all Internet Identity marketing/help content and CTAs, replace with a simple login CTA (to /login) and role-specific entry points while keeping Instant Jobs branding."
        },
        {
          "path": "frontend/src/pages/JobDetailPage.tsx",
          "operation": "modify",
          "description": "Replace Internet Identity gating text (e.g., 'sign in with Internet Identity') with manual-auth gating (login CTA to /login). Ensure apply flow is only available for Jobseeker role."
        },
        {
          "path": "frontend/src/pages/EmployerCandidatesPage.tsx",
          "operation": "modify",
          "description": "Remove useInternetIdentity-based auth checks and migrate to ManualAuth role gating (Employer-only). Keep a clear access denied + login CTA for logged-out users."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Remove dependencies on useInternetIdentity and principal-based query keys where manual-auth session should drive access; update queries/mutations to rely on the authenticated backend session (via manual-auth token) and align cache keys with the new auth model."
        },
        {
          "path": "frontend/src/components/auth/InternetIdentityHelpDialog.tsx",
          "operation": "delete",
          "description": "Delete the Internet Identity help dialog so no Internet Identity help content can appear anywhere in the UI."
        },
        {
          "path": "frontend/src/components/auth/RoleSetupModal.tsx",
          "operation": "delete",
          "description": "Remove the Internet Identity-based role setup modal and replace role selection/profile setup with manual-auth appropriate flows (handled via /login and session role)."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Add an Admin Panel UI at /admin for platform control: metrics dashboard, manage employers/jobseekers, credit controls, unlock logs, and optional job approval/instant disable actions.",
      "acceptanceCriteria": [
        "A dedicated admin route exists (e.g., /admin) and is accessible only when logged in as Admin.",
        "Admin can search/list employers and jobseekers and disable/enable accounts.",
        "Admin can set credit cost per unlock and adjust employer credit balances.",
        "Admin can view unlock logs in the UI.",
        "If job approval is enabled, employers can create jobs but jobs are not visible publicly until admin approval; admin can approve/reject from the panel.",
        "Admin dashboard displays the specified metrics and updates after actions."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminPanelPage.tsx",
          "operation": "create",
          "description": "Create the /admin panel page with a colorful, mobile-first layout: dashboard metrics cards (total employers, total jobseekers, credits used, active jobs) and sections/tabs for Employers, Jobseekers, Credits/Settings, and Unlock Logs."
        },
        {
          "path": "frontend/src/components/admin/AdminMetricsCards.tsx",
          "operation": "create",
          "description": "Add reusable metric card components for the admin dashboard (totals + credits used + active jobs) with responsive, mobile-first styling."
        },
        {
          "path": "frontend/src/components/admin/AdminEmployersTable.tsx",
          "operation": "create",
          "description": "Implement an employers list/search UI with per-employer actions to add/deduct credits and (when available) disable/enable accounts."
        },
        {
          "path": "frontend/src/components/admin/AdminJobseekersTable.tsx",
          "operation": "create",
          "description": "Implement a jobseekers list/search UI with per-user actions to disable/enable accounts (when available)."
        },
        {
          "path": "frontend/src/components/admin/AdminUnlockLogs.tsx",
          "operation": "create",
          "description": "Add an unlock activity viewer that renders employer->unlock records in a readable, mobile-friendly format (with timestamp and credits charged)."
        },
        {
          "path": "frontend/src/components/admin/AdminCreditsSettings.tsx",
          "operation": "create",
          "description": "Add UI controls to set credit cost per unlock and adjust employer balances. Include safe input validation and clear success/error toasts."
        },
        {
          "path": "frontend/src/hooks/useAdminQueries.ts",
          "operation": "create",
          "description": "Create React Query hooks for admin capabilities (list employers/jobseekers, adjust credits, set credit cost per unlock, list unlock logs, fetch metrics). Use the selected \"authorization\" component’s frontend guidance to handle admin-only access denied states and authorization errors gracefully. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Add/extend typings for admin-related backend capabilities needed by the Admin Panel (metrics, account enable/disable, and optional job approval actions) so the UI can be fully wired once backend support exists."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register /admin route and ensure it is wrapped by ProtectedRoute requiring Admin role."
        },
        {
          "path": "frontend/src/components/AppHeader.tsx",
          "operation": "modify",
          "description": "Add an Admin navigation entry when the current session role is Admin, and ensure it is hidden for Jobseeker/Employer/guest."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Update Employer Candidates UI to support credit balance display, locked/unlocked candidate cards, unlock confirmation, and post-unlock reveal of full details.",
      "acceptanceCriteria": [
        "Employer Candidates page shows locked/unlocked states per candidate.",
        "Locked candidates hide mobile/email/company name until unlocked.",
        "Unlock action requires confirmation and shows clear success/error states (including insufficient credits).",
        "Employer UI displays current available credits and updates immediately after a successful unlock.",
        "Unlocked candidates remain unlocked across sessions."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/employer/CandidateUnlockCard.tsx",
          "operation": "create",
          "description": "Create a candidate card component that supports a clear locked/unlocked visual state, shows limited fields pre-unlock, and reveals full details post-unlock. Ensure locked fields (mobile/email/company name) are never rendered when locked."
        },
        {
          "path": "frontend/src/components/employer/UnlockConfirmDialog.tsx",
          "operation": "create",
          "description": "Add a confirmation dialog for unlocking a candidate profile (shows cost per unlock and current credits where available) with clear success/error feedback."
        },
        {
          "path": "frontend/src/hooks/useEmployerCredits.ts",
          "operation": "create",
          "description": "Add React Query hooks for employer credit balance and credit cost retrieval (read-only display) and expose loading/error states."
        },
        {
          "path": "frontend/src/hooks/useUnlockCandidate.ts",
          "operation": "create",
          "description": "Add a mutation hook to call unlockCandidateProfile, handle insufficient credits errors, and invalidate candidate directory + credit balance queries on success."
        },
        {
          "path": "frontend/src/pages/EmployerCandidatesPage.tsx",
          "operation": "modify",
          "description": "Update the page to: display current available credits; render candidates using CandidateUnlockCard; show locked state when backend returns limited fields; prompt before unlock; refresh credits and candidate data after unlock; keep Employer-only access via ProtectedRoute/manual-auth."
        },
        {
          "path": "frontend/src/utils/actorErrorMessages.ts",
          "operation": "modify",
          "description": "Extend error normalization to produce clearer messages for credit/unlock failures (e.g., insufficient credits) and authorization failures, so employer unlock UX shows actionable feedback."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Update job posting/browsing UI for India-focused expectations: ₹ salary formatting, mobile-first card listings, and fast filters (location, salary, experience, process).",
      "acceptanceCriteria": [
        "No UI shows $ currency; all salary displays use ₹.",
        "Jobs browse page includes fast filters for the specified fields and remains usable on small screens.",
        "Job cards and job detail pages use a mobile-first, card-based layout with clear CTAs."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/formatInr.ts",
          "operation": "create",
          "description": "Add a shared INR formatting utility that consistently renders salary values with the ₹ symbol (and optional compact formatting) for all job/candidate salary displays."
        },
        {
          "path": "frontend/src/pages/JobsBrowsePage.tsx",
          "operation": "modify",
          "description": "Implement fast, mobile-first filters for location, salary, experience, and process/role; keep the layout usable on small screens (filters stack/collapse appropriately) and ensure salary filtering uses INR formatting semantics."
        },
        {
          "path": "frontend/src/components/jobs/JobCard.tsx",
          "operation": "modify",
          "description": "Ensure all salary rendering uses the shared INR formatter (₹ only) and refine card spacing/CTA affordances for mobile-first browsing."
        },
        {
          "path": "frontend/src/pages/JobDetailPage.tsx",
          "operation": "modify",
          "description": "Ensure salary rendering uses the shared INR formatter and adjust the apply CTA area to be prominent and mobile-first (no Internet Identity references)."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Apply a fully custom, colorful, mobile-first theme across the app with distinct styling for Jobseeker vs Employer vs Admin sections, preserving Instant Jobs branding and removing any Internet Identity visuals/copy.",
      "acceptanceCriteria": [
        "A cohesive, colorful theme is applied consistently across landing, browse, job detail, jobseeker dashboard, employer dashboard/candidates, and admin panel.",
        "Employer and jobseeker experiences are visually distinct enough to avoid confusion (e.g., navigation, headings, section styling).",
        "All user-facing text is in English and does not reference Internet Identity."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update global theme tokens (CSS variables) to a more unique, colorful palette while keeping accessibility; add role-scoped theme accents (e.g., candidate/employer/admin) via CSS variables/classes applied by layout."
        },
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Apply a role-aware wrapper class/data-attribute (based on ManualAuth role) so employer vs jobseeker vs admin sections get distinct styling while sharing the same base layout."
        },
        {
          "path": "frontend/src/components/AppHeader.tsx",
          "operation": "modify",
          "description": "Visually differentiate current section by role (e.g., badge/color accents) using the role-aware theme hooks/classes; ensure all copy remains English and contains no Internet Identity references."
        },
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Refresh landing visuals to match the new colorful theme and keep Instant Jobs branding; ensure it uses the existing generated assets at frontend/public/assets/generated/instant-jobs-hero.dim_1600x900.png and frontend/public/assets/generated/instant-jobs-logo.dim_512x512.png and contains no Internet Identity references."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Extend Tailwind theme tokens/utilities as needed to support the new colorful, role-distinct UI (e.g., additional semantic colors/gradients) without introducing new global stylesheet entry points."
        }
      ]
    }
  ]
}